[{"id":0, "name":"Apple MacBook Core 2 Duo P7450 2.13GHz 2GB 160GB DVD Laptop (2009) - MC240LL/A", "price":"U$159.95", "image":"/assets/images/0.jpg", "description":"Apple Grade B Refurbished Product. May Contain small cosmetic blemishes w/ 90 Day Warranty", "url":"http://www.ebay.com/itm/332195015528"},
 {"id":1, "name":"Apple iPhone 7 PLUS 128GB (PRODUCT) RED & All Other Colors – Brand New USA Model", "price":"US $844.99", "image":"/assets/images/1.jpg", "description":"APPLE WARRANTY This device comes with the one-year warranty direct from Apple !! You can take the device to any Apple Store for service What's in the Box EarPods with Lightning Connector. iPhone. Lightning to USB Cable. 5W USB Power Adapter. Lightning to 3.5 mm Headphone Jack Adapter. ", "url":"http://www.ebay.com/itm/Apple-iPhone-7-PLUS-128GB-PRODUCT-RED-All-Other-Colors-Brand-New-USA-Model-/162488170439?_trkparms=5373%3A0%7C5374%3AFeatured"},
 {"id":2, "name":"HP OfficeJet 4650 Wireless All-in-One Photo Printer with Mobile Printing", "price":"US $64.99", "image":"/assets/images/2.jpg", "description":"HP OfficeJet 4650 Wireless All-in-One Photo Printer with Mobile Printing Comes with both black and color ink. Main functions of this HP color inkjet photo printer: copy, scan, fax, wireless printing, AirPrint, two-sided duplex printing, touchscreen, Instant Ink ready so you'll never run out of ink, and more Mobile printing: print from anywhere using your smartphone or tablet with the free HP ePrint app, easily print from your iPhone or iPad with AirPrint, print even without a network using Wireless Direct printing 2-sided printing allows you to print on both sides of the page, cutting your paper use by up to 50% Laser quality text and brilliant color for all your documents and projects Save up to 50% on Ink with HP Instant Ink: ordered by your printer and delivered to your door before you run out (optional subscription required). Use Original HP 63 Ink cartridges to print up to 2x the pages as refilled cartridges Fly through tasks with an all-in-one with fax and automatic document feeder Paper sizes supported: Letter, legal, 4 x 6 in, 5 x 7 in, 8 x 10 in, No. 10 envelopes ", "url":"http://www.ebay.com/itm/HP-OfficeJet-4650-Wireless-All-in-One-Photo-Printer-with-Mobile-Printing-/122561359014?_trkparms=5373%3A0%7C5374%3AFeatured"},
 {"id":3, "name":"Generac iX2000 iX Series 2,000W Portable Inverter Generator (CARB) 6719R Refurb", "price":"US $349.99", "image":"/assets/images/3.jpg", "description":"WARRANTY 90 Day Limited For full warranty information, please contact us at 800-714-0969 * Warranty valid for US customers only INTERNATIONAL ORDERS Orders outside the US are not protected by manufacturer warranty. (All orders are still covered by CPO's 30-day Money Back Guarantee) Shipping and customs charges for non-US orders will be calculated when the item is added to cart All corded products are designed to work with North American 110/120V outlets only. Products used in foreign outlets without proper use of a voltage adapter/converter will not be covered by CPO's return policy or 30-Day Money Back Guarantee ", "url":"http://www.ebay.com/itm/Generac-iX2000-iX-Series-2-000W-Portable-Inverter-Generator-CARB-6719R-Refurb-/331979815453?_trkparms=5373%3A0%7C5374%3AFeatured"},
 {"id":4, "name":"Galaxy by Harvic Men's Flat-Front Plaid Cargo Shorts with Belt", "price":"US $14.99", "image":"/assets/images/4.jpg", "description":"All orders are typically shipped within 2 business days after payment has cleared. We do not ship on weekends or holidays. A tracking number * will be sent to the e-mail address you provide in our checkout system. FREE SHIPPING* available to the contiguous 48 US States. We do not offer shipping to PO Boxes. HI, GU, AK, VI, PR, APO & FPO customers : some items may be shipped to you. Please call 800-438-7516 before bidding. Additional costs may apply depending on product weight/size and value. (*) Please verify free shipping at the top of the ad page (*) Some item ship VIA USPS First Class with no tracking # please allow 5-10 business days for delivery.", "url":"http://www.ebay.com/itm/Galaxy-by-Harvic-Mens-Flat-Front-Plaid-Cargo-Shorts-with-Belt-/292119802393?_trkparms=5373%3A0%7C5374%3AFeatured"},
 {"id":5, "name":"2016 FootJoy GreenJoys Series Golf Shoes CLOSEOUT NEW", "price":"US $44.99", "image":"/assets/images/5.jpg", "description":"FOOTJOY GREENJOYS SERIES GOLF SHOES The FootJoy GreenJoy blends sport and style on the golf course. Designed with an easy care synthetic upper and a DuraMax rubber outsole for comfort and grip on the greens, these FootJoy GreenJoy Golf Shoes facilitate performance. The cyclone cleats by Softspikes utilize the Fast Twist system and provide traction and comfort for improved performance during play. Feature Easy-care synthetic upper for all-day comfort Olympic last Cushioned sponge rubber insole enhances feel, even with extended wear DuraMax durable rubber outsoles provide traction and grip Fast Twist System makes changing the spikes easy Cyclone cleats by Softspikes for quality performance", "url":"http://www.ebay.com/itm/2016-FootJoy-GreenJoys-Series-Golf-Shoes-CLOSEOUT-NEW-/401288918616?_trkparms=5373%3A0%7C5374%3AFeatured"},
 {"id":6, "name":"American Tourister Arona Premium Hardside 3 PC. Spinner Luggage Set 20' 25' 29'", "price":"US $159.99", "image":"/assets/images/6.jpg", "description":"PRODUCT FEATURES 4 Multidirectional wheels let you move and pivot with ease. 100% Polycarbonate shells protect your luggage and contents. Retractable push-button handle Interior compression straps keep clothes in place during transit Top and side carry handles make lifting and carrying easy. Scratch-resistant texture keeps luggage looking new. Self-mending zippers feature case-expansion for added capacity when needed. PRODUCT CONSTRUCTION & CARE Polycarbonate Lining: polyester Manufacturer's 10-year limited warranty Wipe clean", "url":"http://www.ebay.com/itm/American-Tourister-Arona-Premium-Hardside-3-PC-Spinner-Luggage-Set-20-25-29-/311557296072?_trkparms=5373%3A0%7C5374%3AFeatured"},
 {"id":7, "name":"Apple iPhone 7Plus | 256 GB | Product RED | (Verizon) | Warranty 6/2018", "price":"US $899.00", "image":"/assets/images/7.jpg", "description":"Product Information This iPhone 7 Plus (PRODUCT)RED™ Special Edition is introduced as part of Apple's anti-HIV/AIDS program. The iPhone 7 Plus is powered by a 2.23 GHz quad-core processor, and 3 GB of RAM. The phone features a water resistant casing with an oleophobic coating to keep off fingerprints, a pressure sensitive Home button with a built-in fingerprint sensor, a 5.5 inches Retina display with a 1080 x 1920 pixels resolution at 401 ppi pixel density, and stereo speakers. The built-in lithium-ion battery provides enough power to support up to 21 hours of talk time or mobile data usage and up to 16 days when on standby mode. The 12MP camera captures all precious moments with auto image stabilization and HDR, while a 7MP front facing camera allows for high quality video calls. The phone measures 158.2 x 77.9 x 7.3 mm, weighs 188 g and has a memory capacity of 256 GB.", "url":"http://www.ebay.com/itm/Apple-iPhone-7Plus-256-GB-Product-RED-Verizon-Warranty-6-2018-/142426233226?epid=235174110&hash=item212943d98a:g:l3kAAOSw6ShZUCJU"},
 {"id":8, "name":"Apple iPhone 7 Plus 128GB Unlocked GSM Verizon Smartphone Multi Colors", "price":"US $699.99", "image":"/assets/images/8.jpg", "description":"This is an iPhone 7 Plus in Manufacturer Refurbished Condition. Item is fully functional. With a clean ESN. This item will come with minor scratches on the screen and/or body of the unit. Scratches can easily be covered with a case or screen protector. Device Is Unlocked For All GSM Carriers (T-Mobile, AT&T, Ultra Mobile, Simple Mobile, Verizon, Cricket, Etc..)! Will NOT Work With Any Other CDMA Carriers (Sprint, Boost Mobile, Page Plus, Etc..) PACKAGE CONTENTS: - iPhone 7 Plus - Lightning Cable - Wall Charger ", "url":"http://www.ebay.com/itm/Apple-iPhone-7-Plus-128GB-Unlocked-GSM-Verizon-Smartphone-Multi-Colors/252945573899?_trksid=p2047675.c100009.m1982&_trkparms=aid%3D888007%26algo%3DDISC.MBE%26ao%3D1%26asc%3D41375%26meid%3D289535e53e064e45a6b1adda5216ab20%26pid%3D100009%26rk%3D1%26rkt%3D2%26sd%3D162488170439"},
 {"id":9, "name":"3 Pack: Visor Clip Sunglasses Holder In Assorted Colors", "price":"US $4.45", "image":"/assets/images/9.jpg", "description":"The worst feeling in the world is being in your car and suddenly the sun comes out, but your sunglasses are nowhere to be found. They’re always in your glove box or center console or someplace else you can’t easily reach. But now, as long as you can reach your sun visor, you’ll easily be able to grab your sunglasses without a problem and without distracting yourself from the road ahead of you. Just slide the clip onto your visor and snap your sunglasses into the clip and you’ll never have to worry about your sunglasses getting lost, scratched, broken or sliding around again. The clips come in assorted colors and are chosen at random.", "url":"http://www.ebay.com/itm/3-Pack-Visor-Clip-Sunglasses-Holder-In-Assorted-Colors-/382042512475?_trkparms=5373%3A0%7C5374%3AFeatured"},
 {"id":10, "name":"2016 FootJoy GreenJoys Series Golf Shoes CLOSEOUT NEW", "price":"US $44.99", "image":"/assets/images/10.jpg", "description":"FOOTJOY GREENJOYS SERIES GOLF SHOES The FootJoy GreenJoy blends sport and style on the golf course. Designed with an easy care synthetic upper and a DuraMax rubber outsole for comfort and grip on the greens, these FootJoy GreenJoy Golf Shoes facilitate performance. The cyclone cleats by Softspikes utilize the Fast Twist system and provide traction and comfort for improved performance during play. Feature Easy-care synthetic upper for all-day comfort Olympic last Cushioned sponge rubber insole enhances feel, even with extended wear DuraMax durable rubber outsoles provide traction and grip Fast Twist System makes changing the spikes easy Cyclone cleats by Softspikes for quality performance ", "url":"http://www.ebay.com/itm/2016-FootJoy-GreenJoys-Series-Golf-Shoes-CLOSEOUT-NEW-/401288918616?_trkparms=5373%3A0%7C5374%3AFeatured"},
 {"id":11, "name":"L'EAU D'ISSEY * ISSEY MIYAKE * Cologne for Men * 4.2 oz * BRAND NEW TESTER", "price":"US $27.49", "image":"/assets/images/11.jpg", "description":"Item specifics Condition: New: A brand-new, unused, unopened, undamaged item (including handmade items). See the seller's ... Read more Brand: Issey Miyake Fragrance Type: Eau de Toilette Fragrance Name: L'eau D'issey Size: 4.2 oz UPC: Does Not Apply ", "url":"http://www.ebay.com/itm/LEAU-DISSEY-ISSEY-MIYAKE-Cologne-for-Men-4-2-oz-BRAND-NEW-TESTER-/291268542794?_trkparms=5373%3A0%7C5374%3AFeatured"},
 {"id":12, "name":"Garmin VivoActive GPS-Enabled Active Fitness iPhone/Android Smartwatch - White", "price":"US $94.95", "image":"/assets/images/12.jpg", "description":"Overview: GPS Smartwatch for the Active Lifestyle Ultra-thin GPS smartwatch with a sunlight-readable, high-resolution color touchscreen Built-in sports apps, including GPS-enabled running, biking and golfing plus swimming and activity tracking, let you view your stats even when away from your phone Pairs with your smartphone to gently vibrate and display alerts for incoming calls, texts, emails and calendar items plus notifications from social media and other mobile apps Customize with free watch face designs, widgets and apps from our Connect IQ™ store Battery charge lasts through all your activities with up to 3 weeks in watch/activity tracking mode or up to 10 hours using GPS From the company that has been developing robust, dedicated wearable technology to improve training metrics for athletes for more than a decade comes the GPS smartwatch for the active lifestyle. Introducing vívoactive — the ultra-thin, lightweight smartwatch with built-in Garmin sports apps that you can wear every day to help you keep a healthy balance between work and life. From Work to Workout Play harder, work smarter, live better with vívoactive. Built-in sports apps keep you active while smart notifications allow you to stay in contact with pressing work matters — all so you can keep your life in balance. The high-resolution, color touchscreen stays readable in direct sunlight, so you can view your stats when you step out of the office for a run. The ultra-thin profile — 8 mm — is comfortable to wear all day and can easily transition from office to golf course. You won’t have to worry about vívoactive keeping up with your active days. The rechargeable battery lasts through all your activities with up to 3 weeks in watch/activity-tracking mode or up to 10 hours using GPS. ", "url":"http://www.ebay.com/itm/Garmin-VivoActive-GPS-Enabled-Active-Fitness-iPhone-Android-Smartwatch-White-/232291849745?_trkparms=5373%3A0%7C5374%3AFeatured"},
 {"id":13, "name":"VIZIO SB3821-C6 38-Inch 2.1 Channel Sound Bar with Wireless SubWoofer", "price":"US $99.99", "image":"/assets/images/13.jpg", "description":"Detailed item info Description Enhance the audio experience and enjoy theater-like sound at home with the Vizio SB3821-C6 Soundbar Speaker System. This 2.1 System model features a frequency response ranging from 50 Hz to 19 KHz. It is equipped digital coaxial and optical audio inputs for easy connectivity. Product Highlights Video Product Identifiers Brand VIZIO Model SB3821-C6 MPN SB3821-C6 UPC 845226012402 Key Features Speaker Type Sound Bar Technical Details Frequency Responses 50 Hz - 19 kHz Sensitivity 100 dB Connectivity Wireless ", "url":"http://www.ebay.com/itm/VIZIO-SB3821-C6-38-Inch-2-1-Channel-Sound-Bar-with-Wireless-SubWoofer-/311589432799?_trkparms=5373%3A0%7C5374%3AFeatured"},
 {"id":14, "name":"BRAND NEW LG G5 H830T 32GB T-Mobile + GSM Unlocked 4G LTE Smartphone", "price":"US $229.99", "image":"/assets/images/14.jpg", "description":"Manufacturer: LG Model LG-H830T SKU SP-LG-G5-NEW UPC 8806084968432 Condition: New Note: BRAND NEW! T-mobile Carrier Unlocked. Phone will work on all GSM networks like AT&T, T-mobile, Metro PCS... Will not work under Verizon or Sprint Availability: In Stock Warranty: Manufacturer Warranty Return Policy Frequencies : GSM 850/900/1800/1900 MHz, UMTS 850/1900/2100, LTE Bands 2/4/5/12/29/30, Roaming 1/3/7/20, and CA Data Transmission : HSPA+, LTE ", "url":"http://www.ebay.com/itm/BRAND-NEW-LG-G5-H830T-32GB-T-Mobile-GSM-Unlocked-4G-LTE-Smartphone-/352049253484?_trkparms=5373%3A0%7C5374%3AFeatured"},
 {"id":15, "name":"ON SALE! 1 oz Sunshine Walking Liberty Silver Round (New, Lot of 10)", "price":"US $176.80", "image":"/assets/images/15.jpg", "description":"Please Note: We are unable to ship to Nevada shipping addresses as a result of the current uncertainty on the application of sales tax to sales of precious metals in Nevada. All orders with a Nevada shipping address will be canceled. JM Bullion is proud to offer the 1 oz Sunshine Walking Liberty Silver Round. Bearing the Walking Liberty image, currently found on the American Silver Eagle, this replica round is a great deal on an iconic image. Round Highlights: Individual rounds ship in plastic flips, whereas quantities of 20 ship in a tube as we receive from the mint. If you would like to receive a tube, you will need to purchase this listing in quantities of 2. Please note we cannot combine orders. Each round contains 1 Troy Ounce of .999 fine silver for a total of 10 Troy Ounces Produced by the renowned Sunshine Minting in Coeur D'Alene, Idaho Contains Anti-counterfeit seal (decoder lens not included) All orders are securely package and shipped with full insurance JM Bullion is one of the nation’s leading online precious metals dealers, serving hundreds of thousands of customers since the company’s inception in 2011. Operating as a lean online retailer, we are able to offer the lowest possible pricing on the most popular gold, silver, and platinum bullion items. All packages ship with full insurance and tracking, with most orders being processed same or next business day. More Items! ", "url":"http://www.ebay.com/itm/ON-SALE-1-oz-Sunshine-Walking-Liberty-Silver-Round-New-Lot-of-10-/391422612602?_trkparms=5373%3A0%7C5374%3AFeatured"},
 {"id":16, "name":"HG Solarsoft Sport Sandals", "price":"US $8.99", "image":"/assets/images/16.jpg", "description":"Perfect for to and from the gym or practice, the HG Solarsoft Slide blends construction with the ultra soft comfort of Solarsoft foam for maximum comfort and style. Breathable, flexible upper features innovative HG technology and is constructed without stitching. Dual-durometer midsole/outsole features a soft, pliable HG Solarsoft foam midsole with optimal airflow and drainage. HG Solarsoft foam in a harder durometer for durable traction. ", "url":"http://www.ebay.com/itm/HG-Solarsoft-Sport-Sandals-/391485013069?_trkparms=5373%3A0%7C5374%3AFeatured"},
 {"id":17, "name":"28pc All Purpose Hole Dozer Hole Saw Kit Milwaukee 49-22-4185 New", "price":"See price on checkout", "image":"/assets/images/17.jpg", "description":"Made in the USA, the Milwaukee 49-22-4185 Hole Dozer Hole Saw features Rip Guard, the strongest tooth form in the industry, backed by the Rip Guard Limited Lifetime Tooth Break Warranty. Each tooth is built with more steel behind the cutting edge for added strength. The Rip Guard warranty on tooth breaks is a first for the hole saw industry. The added tooth strength along with 8% cobalt give added life to the teeth, allowing for increased productivity on the jobsite, as well as continued hole quality. The Hole Dozer includes Plug Jack, an all access slot design that allows for full access during plug removal. The Plug Jack gives access lower into the cup for thick material and higher towards the teeth for thin material. With multiple positions to apply leverage and better plug access, Plug Jack increases productivity and eliminates wasted downtime between holes. For fast, tool-free change-outs, use Milwaukee's universal Quick-Change Arbors. 49-56-7210, 49-56-7240, 49-56-7250, and 49-56-9100. ", "url":"http://www.ebay.com/itm/28pc-All-Purpose-Hole-Dozer-Hole-Saw-Kit-Milwaukee-49-22-4185-New-/322382206877?_trkparms=5373%3A0%7C5374%3AFeatured"},
 {"id":18, "name":"Pebble 2 + Heart Rate Bluetooth Smartwatch for Android or iOS (Black)", "price":"US $61.99", "image":"/assets/images/18.jpg", "description":"sleep tracking Get Pulses Racing See beats-per-minute with heart rate sensing that syncs seamlessly with Pebble Health. Stay in the ideal workout zone with a quick glance at your watch and focus on crushing it! Beat the Competition Track your steps, heart rate, calories burned, and more—all within Pebble Health. Perform better than ever with tailored insights and rock your fitness goals. Recover Like a Pro Rise and truly shine: enjoy Pebble Health's integrated sleep tracking for the deep sleep and recovery time you need. Connect and Act Fast voice, message, notes, dictation, microphone Say the Word Speak your mind with the built-in microphone and voice dictation. Reply to messages, record notes, and more, faster than you can say “lickety-split.” Glance and Go Pebble is your heads-up display for all your phone throws at you. Connect to the action. Dismiss distraction. Respond on the fly. Choose Your Adventure Make Pebble truly yours with over 10,000 available apps for fitness, health, productivity, news, games, and remote controls. ", "url":"http://www.ebay.com/itm/Pebble-2-Heart-Rate-Bluetooth-Smartwatch-for-Android-or-iOS-Black-/232361443734?_trkparms=5373%3A0%7C5374%3AFeatured"},
 {"id":19, "name":"NEW Samsung Galaxy Tab A 7in 1.3GHz Quad Core 8GB 1.5GB GPS 2 Cameras 1080p Vid", "price":"US $89.99", "image":"/assets/images/19.jpg", "description":"NEW Samsung Galaxy Tab A 7in 1.3GHz Quad Core 8GB 1.5GB GPS 2 Cameras 1080p Vid Features Android 5.1 Lollipop Operating System 1.3GHz QuadCore Processor 8GB Storage (Expandable via microSD card slot) 7' Touchscreen Display with 1200x800 Resolution 5MP Rear Camera 2MP Front Camera WiFi 802.11b/g/n + Bluetooth 1 x Micro-USB US retail version and only includes a USA style wall plug ", "url":"http://www.ebay.com/itm/NEW-Samsung-Galaxy-Tab-A-7in-1-3GHz-Quad-Core-8GB-1-5GB-GPS-2-Cameras-1080p-Vid-/292100117646?_trkparms=5373%3A0%7C5374%3AFeatured"},
 {"id":20, "name":"SPECIAL PRICE! 2017 Canada 1 oz Gold Maple Leaf Coin Brilliant Uncirculated", "price":"US $1,272.49", "image":"/assets/images/20.jpg", "description":"Product Description Containing 1 oz of .9999 fine Gold, the 2017 Gold Canadian Maple Leaf is considered one of the most beautiful Gold coins in the world, appealing to both investors and collectors alike for its beauty and high purity. The Maple Leaf has been a national symbol of Canada since the 18th century. The 2017 Gold Maple Leafs feature a unique light diffracting pattern of radial lines, making the coins harder to duplicate and providing another measure of security. Coin Highlights: Contains 1 oz of .9999 fine Gold. Multiples of 10 are packaged in mint tubes. All other coins will be in protective plastic flips. Obverse: Displays a right-facing profile of Queen Elizabeth II, along with the year and face value. Reverse: Features a large, single maple leaf with the weight and purity. New micro-engraved maple leaf privy mark shows a “17” when viewed under magnification. Radial line background was precisely machined by the Royal Canadian Mint onto their master die to create a unique light diffracting pattern, providing another measure of security. Sovereign coin backed by the Canadian government. ", "url":"http://www.ebay.com/itm/SPECIAL-PRICE-2017-Canada-1-oz-Gold-Maple-Leaf-Coin-Brilliant-Uncirculated-/122256371676?_trkparms=5373%3A0%7C5374%3AFeatured"},
 {"id":21, "name":"Captain Toad: Treasure Tracker + amiibo (Wii U, 2016) New Low Price", "price":"US $20.00", "image":"/assets/images/21.jpg", "description":"Ready for Adventure! Captain Toad stars in his own puzzling quest through maze-like mini-universes – only on the Wii U™ console. Each stage is stacked with tricks and traps, so our stubby hero must use his wits to dodge dangers and track those treasures. Survive smoldering volcanoes, hazardous steam engines, haunted houses, and more – all in the name of treasure! That's Captain Toad's mission in life to hunt juicy valuables like Super Gems and Power Stars across puzzling microcosms of danger and delight. Along the way, he'll team up with Toadette to reclaim goods stolen by the monstrous, greedy bird, Wingo. These tiny heroes will have to waddle, hide, pluck, chuck, and power-up their way through enemy-infested locales like wild west shanties, beautiful towers, and Goomba waterparks all bursting with goodies to find and secrets to unearth. Point your head-mounted flashlight toward adventure! Game and Super Mario Series Toad amiibo included; Wii U system sold separately ", "url":"http://www.ebay.com/itm/Captain-Toad-Treasure-Tracker-amiibo-Wii-U-2016-New-Low-Price-/112328650414?_trkparms=5373%3A0%7C5374%3AFeatured"},
 {"id":22, "name":"Xbox One S 1 TB Console - Battlefield 1 Special Edition Bundle", "price":"US $349.99", "image":"/assets/images/22.jpg", "description":"Detailed item info Product Description Product Description The Microsoft Xbox One S is the redesigned and 40 percent smaller version of the gaming console Xbox One. The console does not only allow you to play a plethora of games but, also watch movies and use streaming services. The HDMI-port allows the connection to a TV or a monitor. The console is 4K capable and allows viewing movies in UHD quality. The console is also compatible with the Kinect for Xbox One. This model in contains a built-in 1000 GB hard drive to store all the media and games, comes in a bundle with the game Battlefield 1, and in the military green color for the console and the controller. Product Highlights Video Product Identifiers Brand Microsoft Product Name Microsoft Xbox One S UPC 889842149401 ", "url":"http://www.ebay.com/itm/Xbox-One-S-1-TB-Console-Battlefield-1-Special-Edition-Bundle-/382078371416?_trkparms=5373%3A0%7C5374%3AFeatured"},
 {"id":23, "name":"PUMA Tazon 6 FM Women's Running Shoes", "price":"US $29.99", "image":"/assets/images/23.jpg", "description":"PUMA Tazon 6 FM Women's Running Shoes If your priorities look something like this: working out, eating, sleeping...we get it. And you'll get it when you lace up this new edition of our sleek Tazon running shoes, engineered to give you a comfy and stable ride like none other. Features Synthetic leather upper with perf detailing T-toe construction Lace closure for a snug fit Midfoot saddle for optimum fit and comfort Breathable EcoOrthoLite® sockliner for optimum fit and comfort Cushioned midsole for comfort EVA heel pod offers cushioning and shock absorption TPU shank for increased stability Rubber outsole for grip PUMA No. 1 Logo at tongue PUMA Formstrip at lateral side; PUMA Cat Logo at medial side ", "url":"http://www.ebay.com/itm/PUMA-Tazon-6-FM-Womens-Running-Shoes-/272638832235?_trkparms=5373%3A0%7C5374%3AFeatured"},
 {"id":24, "name":"LG 34' WFHD Monitor (2560x1080) 21:9 UltraWide Curved IPS, 144hz, 1ms (MBR)", "price":"US $499.99", "image":"/assets/images/24.jpg", "description":"FreeSync With FreeSync, gamers can experience seamless, fluid movement throughout hi-res, fast-paced games. FreeSync nearly eliminates tearing and stuttering that can occur because of differences between a graphic card's frame rate and a monitor's refresh rate. 1ms Motion Blur Reduction A monitor's response time is absolutely critical in games. The 1ms Motion Blur Reduction feature will allow gamers to ", "url":"http://www.ebay.com/itm/LG-34-WFHD-Monitor-2560x1080-21-9-UltraWide-Curved-IPS-144hz-1ms-MBR-/322295463136?_trkparms=5373%3A0%7C5374%3AFeatured"},
 {"id":25, "name":"Canon PIXMA PRO-10 Color Professional Inkjet Photo Printer - 6227B002", "price":"US $329.99", "image":"/assets/images/25.jpg", "description":"Product Information Overview As a photographer, you take care to capture the best images possible and you want those images to look as good as you remember when you print them. The PIXMA PRO-10 Wireless Professional Inkjet Printer makes that possible with features that ensure incredible output. A new 10-color LUCIA pigment ink system features three black inks for amazing monochrome prints, and a Chroma Optimizer to ensure the inks lay smooth on the paper which reduces metamerism and bronzing. Since the Lucia inks are pigment based, your prints will have incredible longevity and phenomenal photo vividness. The PIXMA PRO-10 shares technology with the rest of the PIXMA PRO line utilizing the Optimum Image Generating System to ensure what you envision is exactly what you get. The OIG System analyzes each area of the print and chooses the best ink mixture so you see the colors you expect to see in your print. The new Print Studio Pro2 plug-in software makes it even easier to get amazing results from your favorite photo applications. Add to that connectivity options like Wi-Fi, Ethernet and USB and you have a professional machine that easily fits into your workflow that you can place anywhere around the studio. For media support, the PIXMA PRO-10 features two paper trays. A rear tray for a variety of fine art and glossy photo papers, and a manual slot for thicker media to meet your printing needs. ", "url":"http://www.ebay.com/itm/Canon-PIXMA-PRO-10-Color-Professional-Inkjet-Photo-Printer-6227B002-/112451019132?_trkparms=5373%3A0%7C5374%3AFeatured"},
 {"id":26, "name":"HP 10-P020NR 10.1' Touch Laptop Intel Atom X5-Z8350 1.44GHz 2GB 32GB eMMC Win10", "price":"US $229.99", "image":"/assets/images/26.jpg", "description":"HP 10-P020NR 10.1' Touch Laptop Intel Atom X5-Z8350 1.44GHz 2GB 32GB eMMC Win10 Intel Atom X5-Z8350 1.44GHz Quad-Core up to 1.92GHz 2GB DDR3L SDRAM (onboard) 32GB eMMC Intel HD Graphics 400 10.1' diagonal WXGA IPS BrightView WLED-backlit touch edge-to-edge glass (1280 x 800) WLAN 802.11ac and Bluetooth Micro SD Card Reader DTS Studio Sound with dual speakers Front TrueVision HD Camera and rear Vision 5MP Camera Windows 10 ", "url":"http://www.ebay.com/itm/HP-10-P020NR-10-1-Touch-Laptop-Intel-Atom-X5-Z8350-1-44GHz-2GB-32GB-eMMC-Win10-/272675862352?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001615"},
 {"id":27, "name":"Polk Audio Monitor 70 Series II BLACK Tower Speaker NEW EACH", "price":"US $169.99", "image":"/assets/images/27.jpg", "description":"Detailed item info Description Enhance the audio experience and enjoy theatre-like sound at home with the Polk Monitor 70 Series II Floor Standing Speakers. This Single Speaker model features a frequency response ranging from 30 Hz to 25000 Hz and an impedance level of 8 ohms. In addition, the product offers a sensitivity of 90 dB and 275 watt peak power handling capability. Product Identifiers Brand Polk Model Monitor 70 Series II MPN AM7092-A UPC 747192120498 Key Features Speaker Type Floor Standing Speakers Technical Details Peak Power Handling 275 W Nominal Power 300W Frequency Responses 30 Hz - 25 kHz Impedance 8 ohm Sensitivity 90 dB Connectivity Wired ", "url":"http://www.ebay.com/itm/Polk-Audio-Monitor-70-Series-II-BLACK-Tower-Speaker-NEW-EACH-/232323597721?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001615"},
 {"id":28, "name":"Adobe Premiere Elements 15 Disc for PC/Mac", "price":"US $69.98", "image":"/assets/images/28.jpg", "description":"Adobe Premiere Elements 15 Disc for PC/Mac Your life is full of family activities and special events — and you shoot video to capture them all. Adobe Premiere Elements 15 simplifies the organizing and editing so you can have fun creating and sharing great-looking movies. Quickly find any video clip or photo. Make instant movies, or add style with effects, transitions, titles, and themes. Easily remix music to match your movie’s length. And share the way that works best for you—on disc, HDTV, Facebook, and YouTube.* Bring collages to life with photos and videos that show many memories at once. Hazy landscapes? Make every shot look sharp in seconds. Simply tap to do your organizing and quick video edits on touch devices. Pick any music file, and it can be easily remixed to match the length of your movie. Use a new Guided Edit to apply effects across multiple clips or your entire movie at once to create a signature look. Search is a cinch—find videos by places, events, albums, favorites, and more. ", "url":"http://www.ebay.com/itm/Adobe-Premiere-Elements-15-Disc-for-PC-Mac-/192028272595?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001615"},
 {"id":29, "name":"Nerf Zombie Strike Biosquad Zombie Eraser Zr-100 Blaster", "price":"US $9.99", "image":"/assets/images/29.jpg", "description":"Free Shipping on Orders over $14.99 Welcome to the HasbroToyShop eBay store Nerf Zombie Strike Biosquad Zombie Eraser Zr-100 Blaster Defend the world from the zombie hordes with Nerf Zombie Strike blasters! No one knows what happened the day the zombies struck. Strike back with the Nerf Zombie Strike BioSquad Eraser ZR-100 blaster from Hasbro. Scare the zombies into retreat with the Eraser ZR-100 blaster, which sprays Zombie Repellent fluid or fires Zombie Strike darts! Includes blaster, 1 canister of Zombie Repellent fluid, 2 Zombie Strike darts, and instructions. Sprays repellent or fires darts for 2-in-1 blasting Sprays Zombie Repellent fluid or fires darts Pump-to-fire blasting Comes with 1 canister of repellent and 3 Zombie Strike darts Store 2 darts in the handle Frustration Free Packaging. Ages 8 and up 2015 Hasbro. All Rights Reserved. ", "url":"http://www.ebay.com/itm/Nerf-Zombie-Strike-Biosquad-Zombie-Eraser-Zr-100-Blaster-/222316784953?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001615"},
 {"id":30, "name":"NHL Mens Reebok Name & Number S/S Tees", "price":"US $19.00", "image":"/assets/images/30.jpg", "description":"PRODUCT DETAILS Have you been looking for some way to show off your NHL fandom, but don't necessarily want to break out your authentic team jersey? Celebrate your NHL fandom with this Name and Number T-shirt from Reebok. It features bold NHL graphics along with your favorite player's name and number on the back. This NHL tee also features a rib-knit and tagless collar. Material: 100% Cotton Rib-knit collar Tagless collar Short sleeve Screen print graphics Machine wash Officially licensed Imported Brand: Reebok ", "url":"http://www.ebay.com/itm/NHL-Mens-Reebok-Name-Number-S-S-Tees-/352079699557?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000000583"},
 {"id":31, "name":"Apple iPad Pro 9.7' Retina Display 128GB MLMV2LL/A Space Gray", "price":"US $499.99", "image":"/assets/images/31.jpg", "description":"Detailed item info Product Information The Apple iPad Pro Tablet sports a 9.7-inch retina display with a resolution of 2048x1536 pixels and True Tone display. Powered by the A9X chip, and M9 motion coprocessor, it provides high speed and efficiency. This Wi-Fi model has a storage capacity of 128 GB, and runs on the IOS9 operating system. It features a 12 MP iSight camera, allowing you to capture sharp and detailed photographs. In addition, this tablet supports the Smart Keyboard and the Apple Pencil, and is available in space gray. Product Highlights Video Product Identifiers Brand Apple Model Wi-Fi MPN MLMV2LL/A Carrier Not Applicable UPC 888462762670, 888462832847 Key Features Type Tablet Family Line iPad Pro Display Size 9.7in (24.64 cm) Storage Capacity 128GB Operating System iOS Internet Connectivity Wi-Fi Supported File Types .ics, DOC, DOCX, GIF, HTM, HTML, JPG, Numbers, PDF, PPT, PPTX, Pages, RTF, TIFF, TXT, VCF, XLS, XLSX, ZIP Exterior Color Space Gray ", "url":"http://www.ebay.com/itm/Apple-iPad-Pro-9-7-Retina-Display-128GB-MLMV2LL-A-Space-Gray-/361626211215?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000000583"},
 {"id":32, "name":"Proscan PLDED5068A 50-Inch LED 1080p Full HD TV NEW", "price":"US $319.00", "image":"/assets/images/32.jpg", "description":"Overview Proscan is the leader in building quality televisions and this Full 1080P, 50-Inch LED TV is another in their amazing television lineup. Enjoy a perfect picture from this ultra slim edge Pros can TV. The realistic details of every image will remain intact even for those images that move quickly across the TV screen. This is the perfect big game television or for those nights when you want to huddle up on the couch and enjoy that perfect movie. If you are looking for an affordable and high quality large TV, look no further as this 50 inch TV does it all. Pros can has truly knocked it out of the park! ", "url":"http://www.ebay.com/itm/Proscan-PLDED5068A-50-Inch-LED-1080p-Full-HD-TV-NEW-/222539180429?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000000583"},
 {"id":33, "name":"Red Pocket 1 Year Prepaid Wireless Essentials Plan - FREE Alcatel OneTouch Fling", "price":"US $99.00", "image":"/assets/images/33.jpg", "description":"Red Pocket Mobile is a different kind of wireless company We offer no-contract mobile phone and internet service on the nation's best networks, Keep your phone, keep your number, and save money with Red Pocket Mobile. Red Pocket Red Pocket Mobile is proud to be an American-owned company helping people save money, every day.. ", "url":"http://www.ebay.com/itm/Red-Pocket-1-Year-Prepaid-Wireless-Essentials-Plan-FREE-Alcatel-OneTouch-Fling-/132232827512?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000000583"},
 {"id":34, "name":"New 10' Patio Umbrella Offset Hanging Umbrella Outdoor Market Umbrella D10", "price":"US $54.99", "image":"/assets/images/34.jpg", "description":"Item specifics Condition: New: A brand-new, unused, unopened, undamaged item in its original packaging (where packaging is ... Read more Brand: FDW Model: HU1083 MPN: HU-1083 Country/Region of Manufacture: China ", "url":"http://www.ebay.com/itm/New-10-Patio-Umbrella-Offset-Hanging-Umbrella-Outdoor-Market-Umbrella-D10-/391467020947?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001548"},
 {"id":35, "name":"Picnic Double Folding Chair w Umbrella Table Cooler Fold Up Beach Camping Chair", "price":"US $39.94", "image":"/assets/images/35.jpg", "description":"product description Best Choice Products is proud to present this brand new Double Folding Picnic Chair Combo. This set is perfect for use at the park, in your backyard, tailgates, or while you are camping. It features a removable and adjustable umbrella, beverage holding compartment, and a cooler to keep your drinks cold. The set is made with sturdy nylon fabric and comes with a hand carrying case. This chair combo is great for those outdoor sporting events at parks and you can sit in comfort without the hassle of bringing multiple items. NEW PRODUCT WITH FACTORY PACKAGING This set is perfect for use at the park, in your backyard, tailgates, or while you are camping. This chair combo is great for those outdoor sporting events at parks and you can sit in comfort without the hassle of bringing multiple items. It features a removable and adjustable umbrella, beverage holding compartment, and a cooler to keep your drinks cold. The set is made with sturdy nylon fabric and comes with a hand carrying case. The compact folding design is great for traveling especially on the road or during camping trips. Product dimensions: Overall seat dimensions: 20” (L) x 57” (W) x 33” (H), Umbrella: 67” (H) x 60” Diameter. Weight capacity: 250 lbs SPECIFICATIONS: Product dimensions: Overall seat dimensions: 20” (L) x 57” (W) x 33” (H), Umbrella: 67” (H) x 60” Diameter. Weight capacity: 250 lbs Product weight: 14.25 lbs Color: Blue. PLEASE NOTE: Our digital images are as accurate as possible. However, different monitors may cause colors to vary slightly. Some of our items are handcrafted and/or hand finished. Color can vary and slight imperfections in the metal work are normal and considered evidence of the hand-finishing process, which adds character and authenticity to those items. ", "url":"http://www.ebay.com/itm/Picnic-Double-Folding-Chair-w-Umbrella-Table-Cooler-Fold-Up-Beach-Camping-Chair-/360919593519?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001548"},
 {"id":36, "name":"WG591 WORX 56V Lithium-Ion AIR TURBINE Cordless Leaf Blower", "price":"US $156.99", "image":"/assets/images/36.jpg", "description":"The WORX family of TURBINE Blowers takes leaf blowing to a new level. The all-new TURBINE technology delivers forceful, high-capacity air volume to do everything from sweep the driveway and sidewalk after mowing, to piling up those leaves on a fall afternoon. The TURBINE blowers are lightweight, ergonomic and powerful. With three different power options, you can choose which one is right for you and your home. In addition to the multi-speed fan control with TURBO boost, the TURBINE 56V Leaf Blower features a Hyper-Stream air nozzle for extra tough conditions. The Brushless Motor provides long-lasting power and performance in this lightweight and ergonomic yard tool. Finally, a cordless leaf blower that is powerful enough to tackle any conditions around your home and yard. Key Features Powerful blowing speeds up to 220 mph & a 10:1 mulching ratio 2-Speed control provides versatility for both light and heavy duty projects Simple, tool-free assembly gets you up and working quickly One-touch conversion between blowing & mulching ", "url":"http://www.ebay.com/itm/WG591-WORX-56V-Lithium-Ion-AIR-TURBINE-Cordless-Leaf-Blower-/252108033561?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001548"},
 {"id":37, "name":"Karcher K5 Premium Flex 2000PSI 1.4GPM Cold Water Electric Pressure Power Washer", "price":"US $189.99", "image":"/assets/images/37.jpg", "description":"Clean your tough jobs with the Karcher K5 Premium Flex Electric Pressure Washer. This electric power washer is rated at 2000 PSI and 1.4 GPM so it is ideal for your light-duty washing needs such as patio furniture, siding, decks, driveways, and vehicles. The Vario Power Spray wand allows you to adjust the water pressure and the DirtBlaster Spray wand helps you clean 2 times faster with a wider cleaning path. With its 25-foot hose you'll be able to reach the entire length of your cleaning venture. Tackle your next yard project with the help of the superior cleaning power of the Karcher K5 Premium Flex pressure washer. ", "url":"http://www.ebay.com/itm/Karcher-K5-Premium-Flex-2000PSI-1-4GPM-Cold-Water-Electric-Pressure-Power-Washer-/232211426207?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001548"},
 {"id":38, "name":"Dyson SV04 V6 Motorhead Cordless Vacuum | Fuchsia | Refurbished", "price":"US $199.99", "image":"/assets/images/38.jpg", "description":"Information Questions about your order? To ensure your inquiry is handled as efficiently as possible, please contact us using the eBay messaging system or on the Dyson Helpline 1-844- 679-1647 from 8am – 8pm Monday through Friday and 9am – 6pm on Saturday. Please note additional tools, filters and parts ship separately. Please ensure your address is correct, once your order is placed it cannot be changed. Shipping Address Changes In an effort to protect our customers from fraudulent orders we can only ship to the address listed on your order. We cannot make changes after your order has been placed. In order to avoid confusion or issues with delivery please confirm that your address is correct in both eBay and PayPal. It is your responsibility to make sure your address is correct prior to placing your order. Voltage and Power Our products are manufactured to run on 110-120 Volt 60 Hz US-Standard current US/North American style outlets. Canceling your order In order to provide you with the fastest service possible we process orders as close to real-time as possible and can only cancel your order if it has not yet been processed for shipment. ", "url":"http://www.ebay.com/itm/Dyson-SV04-V6-Motorhead-Cordless-Vacuum-Fuchsia-Refurbished-/272637145658?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001477"},
 {"id":39, "name":"15' King Size Medium-Firm Cool Aloe Gel Memory Foam Mattress FREE Pillows/Cover", "price":"US $669.99", "image":"/assets/images/39.jpg", "description":"WHAT A MATTRESS SHOULD BE Made from all-natural materials and designed with cutting-edge technologies, our Utopia memory foam mattress is infused with cool aloe gel that soothes and rejuvenates. You’re on cloud nine every time you sleep. FREE Mattress Cover comes already installed on the Mattress! No assembly required! Free Pillow(s) are rolled in with the mattress at the factory. They are compressed and are sometimes missed underneath the mattress. We do not offer any refunds or replacements for FREE Pillows that are discarded or misplaced. Absolutely no exceptions. All Pillows are Standard Size and Include Shredded Memory Foam with a zippered Pillow Cover. Body Pillow, Throw Pillow/Blanket from Main Image are Not Included. QUICK DETAILS ", "url":"http://www.ebay.com/itm/15-King-Size-Medium-Firm-Cool-Aloe-Gel-Memory-Foam-Mattress-FREE-Pillows-Cover-/161306863706?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001477"},
 {"id":40, "name":"Dyson SV04 V6 Animal Cordless Vacuum | 3 Colors | Refurbished", "price":"US $249.99", "image":"/assets/images/40.jpg", "description":"Information Questions about your order? To ensure your inquiry is handled as efficiently as possible, please contact us using the eBay messaging system or on the Dyson Helpline 1-844- 679-1647 from 8am – 8pm Monday through Friday and 9am – 6pm on Saturday. Please note additional tools, filters and parts ship separately. Please ensure your address is correct, once your order is placed it cannot be changed. Shipping Address Changes In an effort to protect our customers from fraudulent orders we can only ship to the address listed on your order. We cannot make changes after your order has been placed. In order to avoid confusion or issues with delivery please confirm that your address is correct in both eBay and PayPal. It is your responsibility to make sure your address is correct prior to placing your order. Voltage and Power Our products are manufactured to run on 110-120 Volt 60 Hz US-Standard current US/North American style outlets. ", "url":"http://www.ebay.com/itm/Dyson-SV04-V6-Animal-Cordless-Vacuum-3-Colors-Refurbished-/272552976040?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001477"},
 {"id":41, "name":"Fidget Hand Tri-Spinner Anxiety & Stress Relief Manipulative Play Toy", "price":"US $4.99", "image":"/assets/images/41.jpg", "description":"All orders are typically shipped within 2 business days after payment has cleared. We do not ship on weekends or holidays. A tracking number * will be sent to the e-mail address you provide in our checkout system. FREE SHIPPING* available to the contiguous 48 US States. We do not offer shipping to PO Boxes. HI, GU, AK, VI, PR, APO & FPO customers : some items may be shipped to you. Please call 800-438-7516 before bidding. Additional costs may apply depending on product weight/size and value. (*) Please verify free shipping at the top of the ad page (*) Some item ship VIA USPS First Class with no tracking # please allow 5-10 business days for delivery. Expedited Shipping: we will ship your package VIA FedEx Ground, FedEx Home Delivery or USPS Priority Mail (Please allowed 1-4 Days for Delivery). Some packaged will required signature (GearXS not responsible for any delay during weather issues). ", "url":"http://www.ebay.com/itm/Fidget-Hand-Tri-Spinner-Anxiety-Stress-Relief-Manipulative-Play-Toy-/292085016740?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001477"},
 {"id":42, "name":"Dyson SV03 V6 Cordless Vacuum | White | Refurbished", "price":"US $179.99", "image":"/assets/images/42.jpg", "description":"Detailed item info Product Information Vacuum anywhere with the Dyson White 209472-01 Handheld cordless device. The thin design is ideal for bedrooms, bathrooms, cars, and other small areas where it is difficult to plug in a vacuum. The vacuum is super lightweight, making it easy to carry and use anywhere in your home. This cordless vacuum can run for 20 minutes and only takes a few hours to fully recharge. A small pivot head on the vacuum rotates and captures dirt underneath even tight and small areas. A small canister near the handle of the vacuum can be emptied into a garbage can within seconds. It is self-contained and easy to maintain because it does not require bags or filter purchases. Its slim style also makes it easy to store beneath a piece of furniture or in a small closet. Product Highlights Video Product Identifiers Brand Dyson Model V6 Design Handheld MPN 209472-01 Details and Capabilities Filtration Technology Cyclone ", "url":"http://www.ebay.com/itm/Dyson-SV03-V6-Cordless-Vacuum-White-Refurbished-/272486827351?_trkparms=%26rpp_cid%3D58373c70e4b0356d58132d91%26rpp_icid%3D5875120be4b002673377c611"},
 {"id":43, "name":"As Seen on TV Gotham Steel 2' Deep Square Copper Frying Pan- BRAND NEW!", "price":"US $18.99", "image":"/assets/images/43.jpg", "description":"Brand new, ships directly from the manufacturer! Dims 9.5 x 2 x 9.5 Ultra-Non-Stick: Everything just slides right off the pan GOTHAM STEEL weighs less than frying pans of comparable size No oil or butter needed for healthier cooking. 100% safe: PFOA, PTFE, and PFOS-free Safe for all cooktops Does not include lid Dishwasher Safe Gotham Steel Titanium and Ceramic Square 9.5 Nonstick Frying Pan About the Product Gotham Steel is the first product of its class to actually utilize high-grade titanium and ceramic as surface finishing. This sophisticated combination not only ensures maximal durability it also allows for multi-fictional, all-around usage. Titanium plus Ceramic Coating FAQs High-heat threshold to sear perfectly browned steaks! Everything just slides right off, even burnt chocolate and cheese. Food flavor is not altered when cooking tomato-based or any acidic food products thanks to the ceramic component! The non-stick surface cleans easy! Versatile: for stove-top cooking, or baking! Rust-proof all over. Coating doesn't peel off with constant usage and washing. Our Guarantee Not satisfied with your purchase? Just tell us and we will fix things for you. ", "url":"http://www.ebay.com/itm/As-Seen-on-TV-Gotham-Steel-2-Deep-Square-Copper-Frying-Pan-BRAND-NEW-/122344376946?_trkparms=%26rpp_cid%3D58bdfb6ce4b09cb4c4ab7091%26rpp_icid%3D58bdf8e8e4b0037cc66f9593"},
 {"id":44, "name":"Dyson - AM06 Desk Fan - Black/Nickel", "price":"US $249.99", "image":"/assets/images/44.jpg", "description":"DYSON - AM06 DESK FAN - BLACK/NICKEL Oscillation control; remote; Air Multiplier technology; quiet operation; sleep timer; blade- and grille-free design; small footprint Dyson AM06 Desk Fan: Keep your space cool with this versatile fan that features Air Multiplier technology to project smooth yet powerful airflow. Its bladeless design and streamlined air channels provide quiet operation, and its compact size fits neatly on desks and countertops. ", "url":"http://www.ebay.com/itm/Dyson-AM06-Desk-Fan-Black-Nickel-/322234597574?_trkparms=%26rpp_cid%3D58ff8024e4b0cfe7cbee81dd%26rpp_icid%3D5949ac55e4b0d318fe8ddcd7"},
 {"id":45, "name":"PUMA Core-Run Logo T-Shirt", "price":"US $12.99", "image":"/assets/images/45.jpg", "description":"PUMA Core-Run Logo T-Shirt There's fast. And then there's Forever Fast. Just like you, at top of your game all the time, this tee will follow your speedy lead with its moisture-wicking technology and lightweight materials. Features 100% Polyester Crew neck dryCELL designation for moisture-wicking properties that help keep you dry and comfortable Lightweight ultra-breathable fabric for highest performance Flatlock stitching for less friction and higher comfort Core-Run PUMA Cat Logo Graphic ", "url":"http://www.ebay.com/itm/PUMA-Core-Run-Logo-T-Shirt-/272509693663?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001602"},
 {"id":46, "name":"PUMA PWRSHAPE Forever Bra", "price":"US $14.99", "image":"/assets/images/46.jpg", "description":"PUMA PWRSHAPE Forever Bra The PWRSHAPE Forever sports bra is made for every day and any workout that comes its way. This bra provides support for a range of activity from treadmill to track. Highly functional materials draw sweat away from your skin and help keep you dry and comfortable during exercise. Features Get ready for dry with dryCELL Stabilising shoulder straps for bounce control Strong elastic bottom band for additional support Sleek racerback for unrestricted range of motion ", "url":"http://www.ebay.com/itm/PUMA-PWRSHAPE-Forever-Bra-/282223616901?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001602"},
 {"id":47, "name":"PUMA Essential V-Neck T-Shirt", "price":"US $14.99", "image":"/assets/images/47.jpg", "description":"PUMA Essential V-Neck T-Shirt You've got your routine down. The alarm is set, the course is charted...now, all you need is the gear that will get you there and back – and look great doing it. This seemingly simple V-neck is enhanced with dryCELL technology to keep you comfortable and cool and on track to meet all your fitness goals. Features 85% Polyester, 15% cotton yarn dyed stripe jersey with inherent moisture management dryCELL: highly functional materials draw sweat away from your skin and help keep you dry and comfortable during exercise V-neck Self fabric collar and neck tape Flatlock forward shoulder seam and sideseams for reduced friction PUMA Cat Logo at left chest ", "url":"http://www.ebay.com/itm/PUMA-Essential-V-Neck-T-Shirt-/272467296454?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001602"},
 {"id":48, "name":"Fitbit Charge 2 Heart Rate + Fitness Wristband", "price":"US $104.99", "image":"/assets/images/48.jpg", "description":"Features and Functions: PurePulse Heart Rate Tracking Technology Tracks Steps, Distance, Calories, & More Auto Sleep Tracking Sport Tracking & Exercise Recognition Interactive OLED Display See Stats, Time of Day, Exercise Mode Connected GPS Smartphone Notifications App for iOS/Android/Windows Phones Battery Lasts 5 Days on a Charge ", "url":"http://www.ebay.com/itm/Fitbit-Charge-2-Heart-Rate-Fitness-Wristband-/112419157989?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001506"},
 {"id":49, "name":"Garmin Epix Color LCD Touchscreen GPS Mapping Watch w/ Worldwide Basemap", "price":"US $169.99", "image":"/assets/images/49.jpg", "description":"Manufacturer Description Full Color Mapping GPS/GLONASS on Your Wrist 1.4-inch high-resolution color touchscreen Worldwide shaded relief basemap 8 GB built-in memory so you can load up on maps, such as TOPO U.S. 24K and BirdsEye Satellite Imagery Stainless steel EXO™ antenna with GPS/GLONASS reception Altimeter, barometer and 3-axis compass epix is the first-of-its-kind, high-resolution, color, touchscreen GPS/GLONASS mapping watch with worldwide, shaded relief basemap and 1-year BirdsEye Satellite Imagery subscription. Some models also feature preloaded TOPO 100K maps. Eight GB of built-in memory supports additional mapping, including BirdsEye Satellite Imagery and regional TOPO U.S. 24K maps. The revolutionary, stainless steel EXO antenna combined with GPS and GLONASSS reception mean better signal strength and quicker position fixes. Detailed Mapping The epix touchscreen display gives you fingertip pan/swipe access to vivid, detailed maps, including the built-in worldwide shaded relief basemaps. And with 8 GB internal memory and extensive mapping support, you’ll have plenty of room to add (and interact with) compatible maps, including TOPO 24K, BirdsEye Satellite Imagery, City Navigator® and BlueChart® g2 maps. Extensive Navigation Features Our new, high-sensitivity, EXO antenna technology means better GPS signal strength and faster time to your first fix. epix uses HotFix® to access both GPS and GLONASS satellites for noticeably quicker positioning than GPS alone. Once the fix is made, you have access to a full menu of navigation features, including advanced track recording, track navigation, TracBack®, waypoint and coordinate navigation, Sight'n Go and point-by-point routing. ", "url":"http://www.ebay.com/itm/Garmin-Epix-Color-LCD-Touchscreen-GPS-Mapping-Watch-w-Worldwide-Basemap-/172602370145?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001506"},
 {"id":50, "name":"Garmin Oregon 650t 3-inch US TOPO 100K Handheld GPS w/ 8MP Camera 010-01066-30", "price":"US $279.99", "image":"/assets/images/50.jpg", "description":"Manufacturer Description Release Date Information As we near the shipping dates for preorders, please note that we update all release dates using the most currently-available information directly from Garmin. Product launches can be potentially delayed as refinements are made by the manufacturer, however this is beyond our control. Your best bet to receive your Oregon 6-series as soon as possible is to ensure you have a pre-order at GPS City. If you wish to modify a preorder, please contact us directly instead of canceling/reissuing your order, as this action may cause you to move down in the shipping queue. From the moment you cradle the 650t in your hand, you’re ready to enter into a bold new world of Garmin GPS mapping and positioning. With high-sensitivity GPS and GLONASS satellite tracking (more satellites mean faster fixes, even in challenging environments), preloaded TOPO U.S. 100K maps, worldwide basemap with shaded relief and a faster processor, you don’t just look at maps, you interact with them. Zoom in, pan out and rotate using multi-touch in any conditions and even with most gloves. The reflective display technology boosts touchscreen brightness so much that maps and displays are as vivid in full bright sunlight as they are in shade. And, mark memories with an 8 megapixel autofocus camera with digital zoom and automatic flash/torch, plus customizable buttons for 1-touch image capture and waypoint marking. Quality Photos Now you don’t have to take an additional camera with you to take quality photos. Oregon 650t's built in 8 megapixel autofocus digital camera takes photos worthy of sharing. And each photo is geotagged with the location of where it was taken, allowing you to navigate back to that exact spot in the future. Then share the photos from your Oregon 650t via USB with all your friends through Garmin Adventures, the online adventure sharing community. For more storage, insert a microSD card; you can even view pictures from other devices on microSD with Oregon's picture viewer. Double Your Power Oregon 650t features our state-of-the-art dual battery system. You’ll have the option of using the internally rechargeable NiMH pack (included) or traditional AA batteries — NiMH pack charges when the device is connected to external power. Touch and Go Oregon 650t was purposely engineered for the outdoors. It featur ", "url":"http://www.ebay.com/itm/Garmin-Oregon-650t-3-inch-US-TOPO-100K-Handheld-GPS-w-8MP-Camera-010-01066-30-/182521074477?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001506"},
 {"id":51, "name":"Fitbit Alta HR Heart Rate + Fitness Wristband", "price":"US $119.99", "image":"/assets/images/51.jpg", "description":"Get the power of continuous heart rate in Fitbit's slimmest design yet-all day, during workouts and beyond With heart rate, you can better measure calorie burn, and use zones (Fat Burn, Cardio, and Peak) to find the right workout intensity for your goals. With sleep stages powered by PurePulse heart rate, automatically track your time spent in light, deep and REM sleep and take steps toward a better night's rest. See how working out more can improve your health by comparing your resting heart rate trends to your activity. Automatically track your steps, distance, calories burned and active minutes with up to 7 days of battery life ", "url":"http://www.ebay.com/itm/Fitbit-Alta-HR-Heart-Rate-Fitness-Wristband-/132161100891?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001506"},
 {"id":52, "name":"Rockville RPG2X15 Package PA System Mixer/Amp+15' Speakers+Stands+Mics+Bluetooth", "price":"US $349.95", "image":"/assets/images/52.jpg", "description":" Authorized Rockville Dealer ! RPG2X15 : Rockville RPG2X15 premium complete PA bundle with very high end and great sounding components! Includes: (2) 15”ABS molded PA speakers with amazing sound (2) 8 Channel powered mixer with 1200 watts peak output power (2) Foldable Speaker Stands (2) 10 foot ¼” to ¼” Speaker cables (2) Metal wired microphones with Mic clip and XLR cables Speakers : Two 15˝ premium 4 ohm professional long throw woofer with 2” voice coils, and 40 oz magnets! State-of- the-art 1˝ Titanium Diaphragm Driver Tweeter", "url":"http://www.ebay.com/itm/Rockville-RPG2X15-Package-PA-System-Mixer-Amp-15-Speakers-Stands-Mics-Bluetooth-/391622994865?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001514"},
 {"id":53, "name":"NYC Acoustics N212A Dual 12' 700w Powered DJ Party Speaker Bluetooth, Lights+Mic", "price":"US $164.95", "image":"/assets/images/53.jpg", "description":"The NYC Acoustics N212A is one of the coolest speakers on the market. It really gets the party going. This speaker first and foremost was manufactured to give you crystal clear sound. With 700 watts peak power and 350 watts RMS power this is actually one of the most powerful speakers at this price point. If you play this at full volume at a house party, you will likely get complaints from the neighbors. The speaker goes very loud. It is also perfect for small gigs. Please note we are aware of some brands on the market who write 2,000 or 3,000 watts on their speakers and they do not even go half as loud as these. We are honest about our power ratings. If it is not loud enough to your expectations, we will be happy to send you a label and you can get all your money back. Before I talk about the features and options of this item, I wanted to talk about the guts of the unit. It all starts with the cabinet. One thing some audio enthusiasts overlook is the level of importance the enclosure of the speaker has on sound quality. This uses a top of the line wooden enclosure which is one of the reasons the sound quality is so crisp. ", "url":"http://www.ebay.com/itm/NYC-Acoustics-N212A-Dual-12-700w-Powered-DJ-Party-Speaker-Bluetooth-Lights-Mic-/391404430569?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001514"},
 {"id":54, "name":"Rockville RPG152K Dual 15' Powered Speakers, Bluetooth+Mic+Speaker Stands+Cables", "price":"US $289.95", "image":"/assets/images/54.jpg", "description":"Authorized Rockville Dealer The RPG-152K is a complete all-in-one 15” PA system. Everything you need in a pro PA system setup is included: You get two 15” pro audio speakers with 1500 watts of total power. The system includes a master active speaker that features the built in amplifier and a second passive 15” speaker that is powered from the master speaker/amp. Rounding off this system are speaker stands so you can mount the speakers, a microphone and all connection cables necessary, so that you can get your party started right out of the box. The RPG-152K is perfect for DJ applications, karaoke, and parties or for live music gigs. We are very proud to introduce the all new RPG152K. ", "url":"http://www.ebay.com/itm/Rockville-RPG152K-Dual-15-Powered-Speakers-Bluetooth-Mic-Speaker-Stands-Cables-/391237643416?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001514"},
 {"id":55, "name":"Asus UX501VW-XH71T 15.6' Touch 4K Laptop Intel i7-6700HQ 2.6GHz 16GB 512GB W10", "price":"US $929.99", "image":"/assets/images/55.jpg", "description":"Asus UX501VW-XH71T 15.6' Touch 4K Laptop Intel i7-6700HQ 2.6GHz 16GB 512GB W10 Intel Core i7-6700HQ 2.60GHz Quad-Core Turbo up to 3.50GHz 16GB DDR4 SDRAM 512GB SSD NVIDIA GeForce GTX 960M 4GB GDDR5 15.6' Touchscreen 4K Ultra HD (3840 x 2160) Display 10/100/1000 Mbps Gigabit Ethernet (RJ-45) WLAN 802.11ac and Bluetooth 4.0 1.2MP HD Camera Media card reader Windows 10 ", "url":"http://www.ebay.com/itm/Asus-UX501VW-XH71T-15-6-Touch-4K-Laptop-Intel-i7-6700HQ-2-6GHz-16GB-512GB-W10-/272705707518?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001597"},
 {"id":56, "name":"HP Stream 14-ax027cl 14' Laptop Intel Celeron N3060 1.6GHz 4GB 32GB Win10 -White", "price":"US $149.99", "image":"/assets/images/56.jpg", "description":"HP Stream 14-ax027cl 14' Laptop Intel Celeron N3060 1.6GHz 4GB 32GB Win10 -White Intel Celeron N3060 (1.6 GHz, up to 2.48 GHz, 2 MB cache, 2 cores) 4GB DDR3L-1600 SDRAM (1 x 4 GB) 32GB eMMC Intel HD Graphics 400 14' diagonal HD SVA BrightView WLED-backlit (1366 x 768) Intel 802.11ac (2x2) and Bluetooth 4.0 combo 1 x multi-format SD media card reader Front-facing VGA webcam with integrated digital microphone DTS Studio Sound with 2 speakers Windows 10 ", "url":"http://www.ebay.com/itm/HP-Stream-14-ax027cl-14-Laptop-Intel-Celeron-N3060-1-6GHz-4GB-32GB-Win10-White-/263034501060?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001597"},
 {"id":57, "name":"HP Envy 15T-Q400 15.6' Laptop Intel i7-6700HQ 2.60GHz 8GB 1TB Win10", "price":"US $639.99", "image":"/assets/images/57.jpg", "description":"HP Envy 15T-Q400 15.6' Laptop Intel i7-6700HQ 2.60GHz 8GB 1TB Win10 15.6' diagonal 15.6 inch Full HD IPS LED Backlit display Intel Core i7-6700HQ Processor 8 GB DDR3 SDRAM 1 TB 5400 rpm SATA NVIDIA GeForce 820, 2 GB 10/100/1000 Mbps Ethernet media card reader 2-3 Hrs Lithium-ion polymer battery Windows 10 ", "url":"http://www.ebay.com/itm/HP-Envy-15T-Q400-15-6-Laptop-Intel-i7-6700HQ-2-60GHz-8GB-1TB-Win10-/252805463938?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001597"},
 {"id":58, "name":"Outdoor Wicker Patio Furniture Sofa 3 Seater Luxury Comfort Brown Wicker Couch", "price":"US $349.95", "image":"/assets/images/58.jpg", "description":"product description Best Choice Products presents you this beautiful 3-Seat Wicker Sofa. Add style without losing comfort with this 3-person outdoor sofa. Made out of weather resistant wicker on an aluminum frame, it will endure in any of your outdoor spaces. The synthetic resin wicker provides a durable exterior, while still preserving its classic yet modern appearance. The comfortable tan cushions are removable, washable, and fade-resistant. Use the brown sofa as a solo piece or as an add-on to your patio set. NEW PRODUCT WITH FACTORY PACKAGING FEATURES: Fit up to 3 people comfortably in this beautiful and spacious design Weather-resistant wicker on a heavy duty aluminum frame to support up to 880 lbs Washable, removable, and fade-resistant the tan cushions are easy to clean with a damp cloth Sofa Dimensions: 78.5'L x 32'W x 30.5'H; Seat Dimensions: 69.5(L) x 14 ", "url":"http://www.ebay.com/itm/Outdoor-Wicker-Patio-Furniture-Sofa-3-Seater-Luxury-Comfort-Brown-Wicker-Couch-/381228738769?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001598"},
 {"id":59, "name":"Double Hammock With Space Saving Steel Stand Includes Portable Carrying Case", "price":"US $63.94", "image":"/assets/images/59.jpg", "description":"product description Best Choice Products presents you this brand new Double Hammock with Steel Stand. Made of 100% cotton, this hammock is designed to keep you relaxed and comfortable in any outdoor space. It is able to accommodate two adults (up to 450 lbs. collectively), allowing you and a friend to enjoy sharing the hammock on a warm, sunny day. For convenience and durability, it includes a stand that is constructed of sturdy, all-weather resin steel, saving you the hassle of having to purchase a stand separately. With the included carrying case, you can easily pack the hammock and take it anywhere you please with ease. For a convenient and comfortable hammock that you won't find anywhere else, try out the Double Hammock with Steel Stand by Best Choice Products! FEATURES: Made of 100% cotton, this hammock is designed to keep you relaxed and comfortable in any outdoor space For convenience and durability, it includes a stand that is constructed of sturdy, all-weather resin steel Included carrying case allows you to easily pack the hammock and take it anywhere you please w ", "url":"http://www.ebay.com/itm/Double-Hammock-With-Space-Saving-Steel-Stand-Includes-Portable-Carrying-Case-/360986045331?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001598"},
 {"id":60, "name":"16'x32'x52' Intex Ultra Frame Rectangular Pool Kit With Salt System 28375EH", "price":"US $1,268.90", "image":"/assets/images/60.jpg", "description":"Intex 16' x 32' x 52' Rectangle Ultra Frame Swimming Pool With Sand Filter Pump & Saltwater System, Ladder, Ground Cloth, Cover, Maintenance Kit & Volleyball Set Item: B3506 Intex Ultra Frame Pool features a new unique design making it stronger than traditional metal frame pools and even easier to assemble and enjoy. The heavy-duty powder coated frames resist rust and corrosion while the Super Tough™ 3-ply PVC liner stands up to the harshest elements. This pool allows those with smaller yards to use space more efficiently and enjoy more swimming area vs. a comparable round pool. ", "url":"http://www.ebay.com/itm/16x32x52-Intex-Ultra-Frame-Rectangular-Pool-Kit-With-Salt-System-28375EH-/201919622150?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001598"},
 {"id":61, "name":"Dolphin DX3S Automatic Robotic Swimming Pool Cleaner", "price":"US $599.99", "image":"/assets/images/61.jpg", "description":"The DX3S by Dolphin is the first robotic pool cleaner on PoolSupplyWorld.com to offer IntelliScan, which better analyzes your pool surface to offer smarter coverage. The DX3S automatically cleans floors, coves, and climbs walls. This entry level robotic cleaner offers a whole host of features, including a patented swivel cable, weekly timer, and a solid mesh dual level cartridge system. Features IntelliScan Technology analyzes your pool surface to make cleaning as efficient as possible. 3 hour cleaning duration. Swivel cable reduces knots, kinks, and tangles. Weekly timer schedules the DX3S to automatically clean your pool at your convenience! Quick-release dual level filter cartridge. ", "url":"http://www.ebay.com/itm/Dolphin-DX3S-Automatic-Robotic-Swimming-Pool-Cleaner-/311344266002?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001598"},
 {"id":62, "name":"5 PCS Bistro Set Garden Folding Chairs Table Outdoor Patio Furniture", "price":"US $99.99", "image":"/assets/images/62.jpg", "description":"Description This is our brand new and portable 5 Pieces Table And Chairs Set which includes one round table and 4 pieces folding chairs with metal frame and will bring New Life To Your Patio Or Deck. It Is The Perfect Way To Enjoy A Cafe-Style Experience Right Outside Of Your Door with this set .You Can Put It In Your Garden, Patio Or Pool Side As You Want. Don't hesitate to buy one set now! Feature Brand new and high quality One Round Table With 4 Chairs Elegantly Designed, Lightweight and portable With feature of folding, the furniture set is saving space and convenient to transport Metal frame for the chairs and table, durable and sturdy Glass table top Easy To Clean Perfect For Outdoor, Such As Garden, Patio And Pool Side No Assembly Required Specifications Color: Light Green Material: Metal&textilene&glass ", "url":"http://www.ebay.com/itm/5-PCS-Bistro-Set-Garden-Folding-Chairs-Table-Outdoor-Patio-Furniture-/112127750433?_trkparms=%26rpp_cid%3D5910f320e4b0bf1fbe964455%26rpp_icid%3D59336dcbe4b0bc1763262bba"},
 {"id":63, "name":"Intex Inflatable 80-Inch Jump-O-Lene Ring Bouncer For Kids Ages 3-6 | 48267EP", "price":"US $37.99", "image":"/assets/images/63.jpg", "description":"Jump as high as the sky in this Intex Inflatable Jump-O-Lene Bouncer. Your children will have a pep in their step with this fun, inflatable bouncer. It's great, springy fun for children ages 3-6, can handle 2 jumpers, or up to 120 pounds. It has a soft floor, high walls to prevent jumpers from leaping out of bounds, and provides a fun spot to play. It folds easily for transport and storage, includes a repair patch, and can be used indoor or outdoor. Kids are bound to have a good time with this Intex Inflatable Jump-O-Lene Bouncer. ", "url":"http://www.ebay.com/itm/Intex-Inflatable-80-Inch-Jump-O-Lene-Ring-Bouncer-For-Kids-Ages-3-6-48267EP-/350549498031?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001596"},
 {"id":64, "name":"Swimline Swimming Pool Water Inflatable Floating Lounge Chair, Colors Will Vary", "price":"US $22.99", "image":"/assets/images/64.jpg", "description":"Lie out in the sun and softly glide across the water when you chill on the Swimline Inflatable Deluxe Lounge Chair. This pool lounger has back support, an inflatable pillow, armrests, cup holders, and leg rests and is the ultimate in summer relaxation. The leg rest portion of the lounger has an opening where you can dip your toes in to cool down or put your legs if you want to sit up. The upper half has plenty of support and props your arms so you can get even sun exposure. Place a cold drink in each cup holder, or maybe a sunscreen bottle, to stay cool in the sun. Kick back and relax on a comfortable pool chair, the Swimline Inflatable Deluxe Lounge Chair. ", "url":"http://www.ebay.com/itm/Swimline-Swimming-Pool-Water-Inflatable-Floating-Lounge-Chair-Colors-Will-Vary-/390573153851?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001596"},
 {"id":65, "name":"Kids Outdoor Retractable Playhouse Fort With Sandbox Children's Play Area", "price":"US $149.95", "image":"/assets/images/65.jpg", "description":"product description Best Choice Products presents the new Kids Rollaway Sandbox and Fort. This kids fort is built with multifunctionality, with the ability to roll away from the included sandbox. It is constructed with natural fir wood for a stable finish that will resist tough weather conditions. The canvas canopy allows little ones to stay cool and shaded. Store up to 600 pounds of sand in the sandbox and watch your child build castles for hours. Add to play time with the Kids Rollaway Sandbox and Fort by Best Choice Products! FEATURES: Kids fort built with multifunctionality, with the ability to roll away from the included sandbox Constructed with natural fir wood for a stable finish that will resist tough weather conditions Canvas canopy allows little ones to stay cool and shaded Store up to 600 pounds of sand in the sandbox and watch your child build castles for hours Overall Dimensions: 45”(L) x 44.5“(W) x 54“(H); Weight Capacity: 400 lbs. SPECIFICATIONS: ", "url":"http://www.ebay.com/itm/Kids-Outdoor-Retractable-Playhouse-Fort-With-Sandbox-Childrens-Play-Area-/361939903649?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001596"},
 {"id":66, "name":"Inflatable Slide Mighty Bounce House Jumper Castle Moonwalk Without Blower", "price":"US $219.99", "image":"/assets/images/66.jpg", "description":"Inflatable Slide Mighty Bounce House Jumper Castle Moonwalk Without Blower Product description: This is Inflatable Castle, which is a bounce house allows you to really enjoy a great time. It is outstanding overall features and is an ideal bounce house for backyards, indoors, sleepovers and more. What a great present for your little prince or princess to bouncing around. Easy to setup & take down; instructions included. Easy and quick to blow up. Attention:480W Blower Is Required To Use But Not Included! Product Specifications: The best deals on all of your favorite brand name discount office supplies every week only from Pens N More. ", "url":"http://www.ebay.com/itm/Inflatable-Slide-Mighty-Bounce-House-Jumper-Castle-Moonwalk-Without-Blower-/232263624122?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001596"},
 {"id":67, "name":"Inflatable Mighty Bounce House Castle Jumper Moonwalk Bouncer With Blower", "price":"US $249.95", "image":"/assets/images/67.jpg", "description":"ITEM DESCRIPTION Brand New And Good Quality. Easy And Quick To Blows Up Fire-Resistant Ensure The Safety Heavy Duty And Larger In Size Large Mesh Windows Long Fill Tube Keeps Blower Away From Bounce Easy To Setup & Take Down; Instructions Included Material: Heavy Duty 420D Nylon Oxford Max Occupancy: 3 Kids Or 300 Pounds Of Little Party-Hoppers ", "url":"http://www.ebay.com/itm/Inflatable-Mighty-Bounce-House-Castle-Jumper-Moonwalk-Bouncer-With-Blower-/232243605900?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001596"},
 {"id":68, "name":"Crocs Mens Swiftwater River Sandal", "price":"US $24.99", "image":"/assets/images/68.jpg", "description":"Crocs Mens Swiftwater River Sandal Feeling froggish? Leap into the active waters of your choice with the Swiftwater River Sandals, a rugged take on our popular Swiftwater line, designed for amphibious behavior. Adjustable straps provide a secure fit while non-absorbent Croslite™ construction and siped outsoles channel away water in rapid fashion. These all-purpose sandals are as adventurous as you dare to be.Men's Swiftwater River Sandals Details:Lightweight, all-purpose sandalCroslite™ foam construction won't absorb waterTwo adjustable straps for a comfortable, secure fitIconic Crocs Comfort™: soft and supportive ", "url":"http://www.ebay.com/itm/Crocs-Mens-Swiftwater-River-Sandal-/132216708854?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000000567"},
 {"id":69, "name":"Citizen Men's AT8020-54L 'Blue Angels' Stainless Steel Eco-Drive Dress Watch", "price":"US $279.99", "image":"/assets/images/69.jpg", "description":"Detailed item info Product Information Tell time with ease and style while wearing the Citizen Blue Angels World Chronograph A-T AT8020-54L wristwatch for men. Featuring an Eco-Drive with Japanese quartz, these watches boast the Citizen reputation for consistency and quality. Busy professionals and travelers easily keep track of the hour worldwide, thanks to its automatic timekeeping of 26 international cities. An attractive stainless steel band and sapphire-colored dial make this piece an accessory anyone can take pride in wearing. It is quite durable and offers water resistance up to 666 feet. Three chronographs are among its many other features. Reading the time in low light is easy with this Citizen watch's luminous hour, minute, and second hands as well as the discernible hour marks. The blue dial and non-reflective crystal on the watch set off the silver-tone case and adjustable stainless steel band. In the style of a bracelet with a folding clasp, the band features blue ion plating. The strap width is about 0.9 inches. Atomic timekeeping ensures the watch displays accurate time and helps you keep your day in order. It receives a time signal from one of several international locations. An indicator allows you to check signal reception. This Citizen Eco-Drive watch for men also runs on light power. Its solar cell recharges automatically when direct sunlight or fluorescent light shines on the watch's dial. Although the solar cell is hidden beneath the round dial, the design allows light to enter the cell. It needs only five to six hours of light exposure per month to support the watch functions. An indicator reveals its power reserve. Use the watch's three chronographs like a stopwatch. They keep track of time up to 60 minutes. Two of the chronographs are in small dials within the watch's main dial. One of them displays a minute hand, and the other shows a 1/20th-second hand. The watch's one-second hand doubles as a chronographic second hand. All three chronographs operate with the press of a button. The watch's main dial has a third small dial that displays a 24-hour hand. This watch also shows the date and day of the week. Leap years and months under 31 days aren't a problem for its self-adjusting perpetual calendar. A Daylight Saving Time indicator may be switched on and off. Knowing the hour and date in different time zones throughout the planet is a snap with this watch. Easily find them for locations such as Paris, London, Sydney, Athens, Delhi, Bangkok, Tokyo, Beijing, and Rio de Janeiro. Pre-programmed settings also include U.S. cities such as Anchorage, Chicago, Denver, Honolulu, Los Angeles, and New York. The Blue Angels World Chronograph watch for men is 1.69 inches wide and about 0.5 inches thick. It weighs 0.63 ounces. ", "url":"http://www.ebay.com/itm/Citizen-Mens-AT8020-54L-Blue-Angels-Stainless-Steel-Eco-Drive-Dress-Watch-/162292856592?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000000567"},
 {"id":70, "name":"adidas Men's Aero Knit CLIMACOOL Shorts Athletic 10' Inseam Poly Short POCKETS", "price":"US $14.95", "image":"/assets/images/70.jpg", "description":"Take your workouts to the max in this adidas Aeroknit Short! Measurements: Waist Measurement: 31 in Outseam: 21 in Inseam: 10 in Front Rise: 13 in Back Rise: 15 in Leg Opening: 27 in Product measurements were taken using size MD, inseam 10. Please note that measurements may vary by size. ***Please note these do not come bagged*** Product Details Brand adidas Style Shorts Manufacturer adidas Product Type Shorts adidas Training apparel pays attention to the details so distractions are eliminated and the focus is purely on the training. climacool fabric rapidly transports heat and perspiration away from the body. 100% Polyester Poly-cotton blend contrast along yoke and sides of pant feature a dotted print for added flair. Elastic waistband with interior drawstring tie for an adjustable fit. ", "url":"http://www.ebay.com/itm/adidas-Mens-Aero-Knit-CLIMACOOL-Shorts-Athletic-10-Inseam-Poly-Short-POCKETS-/322509886860?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000000567"},
 {"id":71, "name":"DB-Tech Electric Boiled Egg Cooker Poacher - With Automatic Shut off an Buzzer", "price":"US $24.99", "image":"/assets/images/71.jpg", "description":"1-800-SKYMALL Menu BABY CAMERAS & PHOTOS CELL PHONES & ACCESSORIES COMPUTERS / TABLETS & NETWORKING CONSUMER ELECTRONICS HEALTH & BEAUTY HOME & GARDEN MUSICAL INSTRUMENTS & GEAR BRANDS DB-Tech Electric Boiled Egg Cooker Poacher - With Automatic Shut off an Buzzer Make eggs using the DB-Tech egg cooker in a jiffy and you can choose from soft, medium or hard-boiled. It is extremely easy to use just Measure out and add the required amount of water using the markings on provided measuring cup, pierce the eggs with the included pin (to eliminate cracking), then place the eggs on the tray, plug it in, and switch it on. The steam will cook the eggs, so you can have perfectly boiled eggs every time. Amount of water controls the cooking time, The cooker will automatically shut off once it detects that there is no more water in the cooker and the alert buzzer sound off to lets you know that the eggs are ready. When the buzzer sounds your eggs are done, just the way you love them, ready for cooling and serving using the same removable tray they're on. Features: - Egg Cooker Automatically shuts off when eggs are ready, and sounds a buzzer to let you know that they are done - Conveniently cooks 1 to 7 eggs in minutes, just add water, eggs, and plug it in - The Egg Boiler heats up quickly, boils your eggs in just a few minutes, and shuts off automatically when the eggs are done - Egg Cooker ", "url":"http://www.ebay.com/itm/DB-Tech-Electric-Boiled-Egg-Cooker-Poacher-With-Automatic-Shut-off-an-Buzzer-/182498186726?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001599"},
 {"id":72, "name":"5 STAGE 50 GPD Water Filter System Reverse Osmosis RO Filtration Drinking Home", "price":"US $86.90", "image":"/assets/images/72.jpg", "description":"Features: Offers up to 50 Gallons Per Day in bottled water quality Refreshing, Crisp Taste Superior to Bottled Water Can be attached to the kitchen tap or installed under sink System only to be used on biologically safe water supply Efficient to reduces: copper, lead, fluoride, cadmium, selenium, arsenic, cysts ,barium, trivalent chromium, copper, lead, fluoride, Odor, TDS many more ", "url":"http://www.ebay.com/itm/5-STAGE-50-GPD-Water-Filter-System-Reverse-Osmosis-RO-Filtration-Drinking-Home-/191729375346?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001599"},
 {"id":73, "name":"Wolfgang Puck Pressure Oven Original 29-Liter Stainless Steel", "price":"US $89.99", "image":"/assets/images/73.jpg", "description":"Wolfgang Puck Pressure Oven Original 29-Liter Stainless Steel Countertop Oven Shipping Is FREE! description: The Wolfgang Puck Pressure Oven uses Flavor Infusion TechnologyTM, a breakthrough in cooking that uses a moisture-sealed, low-pressurized chamber to infuse heat, flavor, and moisture into your food -- while cooking up to 70% faster! Get sweeter, flavor-infused vegetables more quickly. Poultry cooks in one-third the time. Roast pork and beef are done in about half the time. Even your favorite casseroles and baked goods cook faster than normal in this ideal cooking environment. Convenient countertop size is small enough to fit under your cabinets yet large enough for a 14 lb. turkey or 12' pizza. Also includes Standard Mode option when you want to cook like your conventional oven, but using a fraction of the energy. Make the most moist, flavorful meals you have ever had. Includes: Countertop Oven, Roasting Pan, Drip/Bake Pan, Crumb Tray, Broil Rack, Recipe Booklet, & User Guide. This model does not contain a rotisserie. ", "url":"http://www.ebay.com/itm/Wolfgang-Puck-Pressure-Oven-Original-29-Liter-Stainless-Steel-/112214142056?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001599"},
 {"id":74, "name":"Blendtec Total Blender /w WildSide Jar + Extra Jar Bundle (Choose Your Bundle!)", "price":"US $299.95", "image":"/assets/images/74.jpg", "description":"Cool off with a delicious cold smoothie on a warm summer day or enjoy some freshly prepared homemade soup for dinner with Blendtec?s total classic blender. This all in one appliance is your answer for fast and efficient preparation of anything whether it is fresh juice, milkshakes, soups, dressings or salsas. The blender replaces up to 9 other appliances with 1 fast easy to use machine. Its ultra-powerful ultra-hard stainless steel blades are cold forged and tuned for heavy use. This allows them to resist corrosion much better than other blades. The blender?s patented vertical wingtip and precision angles are all carefully engineered for efficiency; the single blade design allows your ingredients to fall easily in front of the blades for efficient performance. With Blendtec you can now own the power of a professional restaurant quality blender in your home. ", "url":"http://www.ebay.com/itm/Blendtec-Total-Blender-w-WildSide-Jar-Extra-Jar-Bundle-Choose-Your-Bundle-/311866485492?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000001599"},
 {"id":75, "name":"CK ONE SUMMER 2015 edition a new fragrance 3.4 oz. edt Perfume 100 ml New NIB", "price":"US $22.30", "image":"/assets/images/75.jpg", "description":"• Shipping & Handling is FREE for all domestic shipments within the US • USA Domestic orders are shipped via USPS Priority Mail, or standard first class USPS Express delivery is available for expedited shipping. If you choose this method your order will ship the next business day via express mail • We ship via U.S. Postal Service to PO Boxes, APOs/FPOs • All Domestic shipments come with a delivery confirmation and/or a tracking number. We will e-mail the tracking number once your package ships • Payments are processed in the order in which they are received usually within 24-48 hours of payment received/cleared • We ship Monday-Friday excluding holidays. ", "url":"http://www.ebay.com/itm/CK-ONE-SUMMER-2015-edition-a-new-fragrance-3-4-oz-edt-Perfume-100-ml-New-NIB-/232145723475?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000000532"},
 {"id":76, "name":"HemingWeigh 13-19lb Rock Salt Lamp on Wood Base, Electric Wire & Bulb Included", "price":"US $18.99", "image":"/assets/images/76.jpg", "description":"HemingWeigh 13-19lb Rock Salt Lamp on Wood Base, Electric Wire & Bulb Included Desciption Himalayan salt lamp emits a number of negative ions into surrounding atmosphere when it is heated by an external source of electric or candles. The heat produced from the lamp breaks down Na CL Sodium Chloride in a process called ionization. This process is enhanced by natural process of NACL and resulting in producing of negative ions which eliminate the positive ions which are present in our surroundings produced from daily household items such as, Computers,refrigerators, T.V sets and etc. Thus these lamps make the air clean, fresh and healthy to live in. The HemingWeigh® Rock Salt Lamp is both decorative and a good choice for a purer atmosphere and healthy living. Natural Salt is found in ancient evaporated sea beds underneath great mountain masses, such as the Himalayas, where it has been compressed over time to form solid salt rock, with all the minerals structurally intact. Crafted Salt Lamps These are the most common shapes of the salt lamps we produce. In this category, Lamps are crafted with the machines by experienced crafters. So this is the why that most of the lamps come in the same size and shape comparing to natural shapes. Although the machines used are not digital, an experienced crafter is needed to shape them in a regular size. Our accuracy is up to 90% in shapes and weight categories. ", "url":"http://www.ebay.com/itm/HemingWeigh-13-19lb-Rock-Salt-Lamp-on-Wood-Base-Electric-Wire-Bulb-Included-/201906568916?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000000532"},
 {"id":77, "name":"1 Million Cologne by Paco Rabanne, 3.4 oz EDT Spray for Men NEW", "price":"US $55.06", "image":"/assets/images/77.jpg", "description":"The house of Paco Rabanne's fragrance for men is announced as a fresh and sensual blend of notes, with glittery shine of gold. The perfume was inspired by Paco Rabanne's metallic fashion. Notes of sparkling grapefruit, red orange, mint, rose, cinnamon, spices, blond leather, blond wood, patchouli and amber. Attributes: 100% Authentic Brand New in Retail Packaging Brand:Paco Rabanne Gender:Men Type:Eau De Toilette Condition: New Size:3.4 oz Fast Shipping ", "url":"http://www.ebay.com/itm/1-Million-Cologne-by-Paco-Rabanne-3-4-oz-EDT-Spray-for-Men-NEW-/141573542079?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000000532"},
 {"id":78, "name":"Gucci Bamboo by Gucci for Women 2.5 oz EDP Spray (Tester) Brand New", "price":"US $38.99", "image":"/assets/images/78.jpg", "description":"Item ID 737052925172 Availability Usually ships within 1 business day 100% Authentic Product Guarantee Free Domestic Shipping on orders over $60 get to know us better Product Description More Information Feature Spray UPC/EAN 088300150458 Fragrance Notes Patchouli, Vanilla Fragrance Family Woody Launch Date 2005 Season Fall/Winter Shipping & Returns SHIPPING INFORMATION $5.95 Flat-Rate Standard Domestic 48 US Shipping Transit Time: 2 - 8 business days Free Standard Shipping on orders $60+ shipped within the domestic 48 US States. International Shipping: click here For more information about Domestic & International Shipping, click here. ", "url":"http://www.ebay.com/itm/Gucci-Bamboo-by-Gucci-for-Women-2-5-oz-EDP-Spray-Tester-Brand-New-/222308175193?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000000532"},
 {"id":79, "name":"Sperry Women's Firefish Stripe Leather Fabric Ankle-High Leather Flat Shoe", "price":"US $51.99", "image":"/assets/images/79.jpg", "description":"Product Description Catalog #1681972288 Occasionally you need a pair of shoes for simply relaxing. A pair of carefree, kick-back shoes that aren't meant for sports, work or any other targeted activity, shoes that are convenient for wearing at your leisure when YOU want. This pair of Sperry shoes fills that bill to a T. With their spontaneous style and devil-may-care looks your Sperry shoes are absolutely perfect for drifting around town, around the house, around the yard, or around the vacation spot you're dreaming of traveling to this year. You don't care so much about how they look as much as how they feel because while they might lack a little in the style department they more than make up for it with their comfort. With their traction-assisting outer manmade sole and breezy-looking appearance, these wonderful shoes with a padded foot-bed are flat-soled comfort-mongers, and the absolute best when it comes to making you and your feet feel happy! Distinct from the standpoint that they can easily adapt to a variety of activities while also helping you through your busy days in so many different ways, these versatile shoes will never let you down! They are perfect for wearing during those everyday chores you need to conquer around the house, perfect for working in the garden or elsewhere in the yard, a delight to wear when shuttling kids, parents, pets or objects around town in the car, and completely unequaled when it comes to making you happy and content. When you need a shoe that you can slip on and forget about for the rest of the day, a pair of shoes so comfortable that you will almost forget that you even have them on, then this pair of Sperry shoes is without a doubt the perfect answer. ", "url":"http://www.ebay.com/itm/Sperry-Womens-Firefish-Stripe-Leather-Fabric-Ankle-High-Leather-Flat-Shoe-/132030340919?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000000564"},
 {"id":80, "name":"Jerzees Women's SpotShield Short Sleeve Solid Polo Shirt 437W", "price":"US $7.33", "image":"/assets/images/80.jpg", "description":"No muss, and no fuss is included with this value-priced, stain-resistant jersey polo. Care instructions: Machine wash cold with like colors. Do not bleach. Do not use fabric softener. Tumble dry low. 5.6 oz. SpotShield fabric repels water and most oil-based spills slightly contoured silhouette with side seams and clean-finished side vents Four pearlized buttons cross-stitched onto an elongated placket with reinforced bottom box Preshrunk 50% cotton/50% polyester jersey ", "url":"http://www.ebay.com/itm/Jerzees-Womens-SpotShield-Short-Sleeve-Solid-Polo-Shirt-437W-/182180329706?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000000564"},
 {"id":81, "name":"Kate Spade Nova & Fifi Women's EVA Flip Flops Sandals Assorted Prints", "price":"US $29.99", "image":"/assets/images/81.jpg", "description":"US Shipping • All orders are processed within 48 hours of payment on business days. • All merchandise ships from the United States. • Kentucky residents are responsible for 6% sales tax. • All United States FedEx Ground, 2 Day and Next Day Air shipments, with merchandise value of $100 or more, and/or shipping to an apartment or condo complex will require a signature upon delivery. No exceptions. • All shipping methods come with tracking visibility. All tracking numbers are sent via e-mail within 24-48 hours of payment being received. If you do not receive the tracking number, please contact customer service. • On orders that include more than one item, combined shipping rates will apply. In order to get combined shipping, please pay for all items with one payment. If items do not automatically combine into one checkout, please contact customer service before submitting payment. ", "url":"http://www.ebay.com/itm/Kate-Spade-Nova-Fifi-Womens-EVA-Flip-Flops-Sandals-Assorted-Prints-/361958183554?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000000564"},
 {"id":82, "name":"MICHELE Jellybean Stainless Steel Pink Topaz Stones Women's Watch MWW12P000008", "price":"US $111.99", "image":"/assets/images/82.jpg", "description":"Item specifics Condition: New with tags: A brand-new, unused, and unworn item (including handmade items) in the original packaging (such as ... Read more Brand: Michele Features: Diamond, Rubber, Stainless Steel MPN: Michele-MWW12P000008 Functions: Hour, Minute, Second UPC: 099945499888 Gender: Ladies Manufacturer: Michele Watches Luminescence: Hands Band Width: 10 mm Material: Rubber Case Material: Stainless Steel Movement: Quartz Case Shape: Round Retail price: 295 Clasp: Buckle Size: 35 mm Color: Sunray Silver White with Topaz Stones Style: Casual Watches Crystal Type: Scratch Resistant Mineral Water Resistance: 50 meters / 165 feet ", "url":"http://www.ebay.com/itm/MICHELE-Jellybean-Stainless-Steel-Pink-Topaz-Stones-Womens-Watch-MWW12P000008-/262863594664?_trkparms=5373%3A0%7C5374%3AFeatured%7C5079%3A6000000564"}]